# EndCap Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..EndCap Property
CompoundStructure Class See Also
---
Indicates the end cap condition defining which shell layers will participate in end wrapping.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public EndCapCondition EndCap { get; set; }
```

Visual Basic
---
```text
Public Property EndCap As EndCapCondition
	Get
	Set
```

Visual C++
---
```text
public:
property EndCapCondition EndCap {
	EndCapCondition get ();
	void set (EndCapCondition value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace